TC3045/Parcial dos/Feb24/BeanShell PreProcessor.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="url" elementType="Argument">
            <stringProp name="Argument.name">url</stringProp>
            <stringProp name="Argument.value">api.fixer.io</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="currency" elementType="Argument">
            <stringProp name="Argument.name">currency</stringProp>
            <stringProp name="Argument.value">USD</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">27</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1487949167000</longProp>
        <longProp name="ThreadGroup.end_time">1487949167000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${url}</stringProp>
          <stringProp name="HTTPSampler.path">/latest?base=${currency}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">String[] array = {&quot;EUR&quot;, &quot;AUD&quot;, &quot;BGN&quot;, &quot;BRL&quot;, &quot;CAD&quot;, &quot;CHF&quot;, &quot;CNY&quot;, &quot;CZK&quot;, &quot;DKK&quot;, &quot;GBP&quot;, &quot;HKD&quot;, &quot;HRK&quot;, &quot;HUF&quot;, &quot;IDR&quot;, &quot;ILS&quot;, &quot;INR&quot;, &quot;JPY&quot;, &quot;KRW&quot;, &quot;MXN&quot;, &quot;MYR&quot;, &quot;NOK&quot;, &quot;NZD&quot;, &quot;PHP&quot;, &quot;PLN&quot;, &quot;RON&quot;, &quot;RUB&quot;, &quot;SEK&quot;};


String url = vars.get(&quot;url&quot;);
String currency = array[(ctx.getThreadNum())];
vars.put(&quot;currency&quot;, array[ctx.getThreadNum()]);


System.out.println(&quot;URL: &quot; + url);
System.out.println(&quot;Currency: &quot; + currency);
System.out.println(&quot;Counter: &quot; + ctx.getThreadNum());</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">String url = prev.getUrlAsString();
String rc = prev.getResponseCode();
String rd = prev.getResponseDataAsString();
FileWriter fw = new FileWriter(&quot;/Users/biller/Documents/TEC/Sexto Semestre/QA/PruebasYCalidadSoftware/TC3045/Parcial dos/Feb24/prueba.csv&quot;, true);
BufferedWriter bw = new BufferedWriter(fw);

bw.write(&quot;url: &quot; + url);
bw.write(&quot;Response Code: &quot; + rc);
bw.write(&quot;Response Data: &quot; + rd);

bw.close();
fw.close();</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
